{
    "sucesso": true,
    "mensagem": "Lista de livros.",
    "dados": [
        {
            "liv_cod": 66,
            "liv_nome": "Dom Casmurro",
            "liv_pha_cod": "A865d",
            "liv_categ_cod": "0.820",
            "liv_foto_capa": "/public/uploads/CapaLivros/dom casmurro.jpg",
            "liv_desc": "Dom Casmurro é uma obra clássica do Realismo Brasileiro e uma das mais famosas de Machado de Assis. É o romance mais estudado, comentado e discutido de Machado de Assis – o que significa dizer um dos mais estudados da nossa literatura. Publicado originalmente em 1899, o livro conta a história de Bentinho e Capitu, desde o namoro infantil até o casamento atormentado pelo ciúme e pela dúvida que virou polêmica literária: Capitu traiu o marido com o melhor amigo dele, Escobar? Os fatos são narrados por Bentinho, que relembra, já velho, episódios de sua vida.",
            "edt_cod": 26,
            "edt_nome": "Companhhia das letras",
            "aut_nome": "Assis, Machado",
            "aut_cod": 62,
            "Generos": "Ficção",
            "exemplares": 1,
            "emprestados": 0,
            "disponivel": 1
        },
        {
            "liv_cod": 69,
            "liv_nome": "Os Miseráveis",
            "liv_pha_cod": "H8890",
            "liv_categ_cod": "0.840",
            "liv_foto_capa": "/public/uploads/CapaLivros/os miseráveis.jpg",
            "liv_desc": "Em Os Miseráveis, o maior clássico do Romantismo francês, Victor Hugo desenvolve a trama a partir dos conflitos entre dois antagonistas: Jean Valjean e Javert. Com críticas à sociedade da época, esta adaptação trabalha temáticas universais, como a desigualdade social e os dilemas morais que cada indivíduo precisa enfrenta.",
            "edt_cod": 26,
            "edt_nome": "Companhhia das letras",
            "aut_nome": "Hugo, Vitor",
            "aut_cod": 65,
            "Generos": "Ficção",
            "exemplares": 1,
            "emprestados": 0,
            "disponivel": 1
        },
        {
            "liv_cod": 72,
            "liv_nome": "Verity",
            "liv_pha_cod": "H759v",
            "liv_categ_cod": "0.810",
            "liv_foto_capa": "/public/uploads/CapaLivros/verity.jpg",
            "liv_desc": "Verity é um romance finalista do prêmio Goodreads de 2019 que mergulha no suspense psicológico. Lowen Ashleigh, uma escritora à beira da falência, é contratada para concluir uma série de sucesso após um acidente deixar a autora original, Verity Crawford, incapacitada. Ao investigar os escritos de Verity, Lowen descobre uma autobiografia perturbadora que revela segredos sombrios sobre o casamento de Verity e seu marido Jeremy, incluindo eventos trágicos envolvendo suas filhas. Enquanto mergulha mais fundo na vida de Verity, Lowen se vê envolvida em uma rede de mentiras e segredos, questionando-se sobre o que revelar e o que esconder. Colleen Hoover surpreende seus leitores com este suspense intenso que explora o lado mais obscuro das relações humanas.",
            "edt_cod": 26,
            "edt_nome": "Companhhia das letras",
            "aut_nome": "Hoover, Collen",
            "aut_cod": 70,
            "Generos": "Mistério",
            "exemplares": 1,
            "emprestados": 0,
            "disponivel": 1
        },
        {
            "liv_cod": 73,
            "liv_nome": "Harry Potter e a Pedra filosofal",
            "liv_pha_cod": "R788h",
            "liv_categ_cod": "0.028",
            "liv_foto_capa": "/public/uploads/CapaLivros/harry potter e a pedra filosofal.jpg",
            "liv_desc": "Harry Potter é uma saga literária que cativa um público diversificado, apesar de ser inicialmente destinada ao público infantojuvenil. A história acompanha Harry Potter, um órfão cujos pais foram assassinados por um poderoso bruxo quando ele era bebê. Criado pelos tios que o tratam mal, Harry descobre, aos 11 anos, que é um bruxo e é convidado a frequentar a Escola de Magia e Bruxaria de Hogwarts. Lá, ele descobre sua verdadeira história e seu destino: enfrentar o bruxo das trevas que matou seus pais. A série, repleta de elementos mágicos como fantasmas, dragões e feitiços, também aborda questões mais profundas, como o conflito entre o bem e o mal, preconceito, divisão de classes, entre outros temas universais, tornando-se uma obra que vai além do entretenimento.",
            "edt_cod": 28,
            "edt_nome": "Rocco",
            "aut_nome": "Rowling, J.K",
            "aut_cod": 71,
            "Generos": "Ação",
            "exemplares": 1,
            "emprestados": 1,
            "disponivel": 0
        },
        {
            "liv_cod": 74,
            "liv_nome": "A Culpa é das Estrelas",
            "liv_pha_cod": "G83a",
            "liv_categ_cod": "0.810",
            "liv_foto_capa": "/public/uploads/CapaLivros/a culpa e das estrelas.jpg",
            "liv_desc": "A Culpa é das Estrelas, Com humor, doçura e melancolia, John Green narra o romance de dois adolescentes que se conhecem em um Grupo de Apoio para Crianças com Câncer. Hazel é uma paciente terminal cuja vida vem sendo prolongada por uma nova droga. Augustus foi jogador de basquete até perder uma perna para o osteossarcoma. Como Hazel, Gus gosta de ironizar os clichês do mundo do câncer – sua principal arma para encarar a doença que abrevia seus dias.",
            "edt_cod": 30,
            "edt_nome": "Intrínseca",
            "aut_nome": "Green, John",
            "aut_cod": 72,
            "Generos": "Autobiográfico,Comédia,Drama,Ficção Científica,Mistério,Romance",
            "exemplares": 18,
            "emprestados": 2,
            "disponivel": 16
        },
        {
            "liv_cod": 76,
            "liv_nome": "Procure nas Cinzas",
            "liv_pha_cod": "D738p",
            "liv_categ_cod": "0.810",
            "liv_foto_capa": "/public/uploads/CapaLivros/procure nas cinzas.jpg",
            "liv_desc": "Procure nas Cinzas, Victoria Ford estava tendo um caso extraconjugal com um escritor de sucesso quando ele é encontrado morto de modo tão espetacular que a notícia ocupou os telejornais por várias semanas. Na cena do crime, havia vestígios do DNA de Victoria por toda parte. Mas ela jurava à irmã, Emma, que não cometeu o crime.\nDuas décadas depois, Emma já não tem mais esperanças de provar a inocência de Victoria. Até que, com o seu DNA identificado entre as cinzas do WTC, Avery Mason, que comanda o programa de investigação de maior audiência da TV, a procura atrás de respostas e decide ajudar Emma a tentar provar a inocência da irmã morta.\nMas a jornada pela verdade não será tão simples. Há diversos mistérios encobertos que muitos queriam que permanecessem enterrados naquele 11 de setembro de 2001",
            "edt_cod": 27,
            "edt_nome": "Faro",
            "aut_nome": "Donlea, Charlie",
            "aut_cod": 69,
            "Generos": "Suspense",
            "exemplares": 2,
            "emprestados": 0,
            "disponivel": 2
        },
        {
            "liv_cod": 77,
            "liv_nome": "Deixada para Trás",
            "liv_pha_cod": "D738p",
            "liv_categ_cod": "0.810",
            "liv_foto_capa": "/public/uploads/CapaLivros/deixada para trás.jpg",
            "liv_desc": "Deixada para Trás, Nicole e Megan, estudantes do último ano do ensino médio, desaparecem de uma festa em Emerson Bay, Carolina do Norte. Um ano depois, Megan retorna, transformada em uma celebridade após lançar um livro sobre seu sequestro, mas Nicole ainda está desaparecida. Livia, irmã mais velha de Nicole e estudante de patologia forense, aguarda ansiosamente por notícias do corpo de sua irmã. Quando uma pista surge ligando Nicole ao passado de outra vítima encontrada, Livia investiga e descobre uma conexão entre vários desaparecimentos de garotas. Enquanto Livia e Megan se aprofundam na investigação, percebem que o terror verdadeiro pode estar mais próximo do que imaginavam.",
            "edt_cod": 27,
            "edt_nome": "Faro",
            "aut_nome": "Donlea, Charlie",
            "aut_cod": 69,
            "Generos": "Suspense",
            "exemplares": 1,
            "emprestados": 0,
            "disponivel": 1
        }
    ],
    "nItens": 7
}